mysql -u root -p 登陆
show databases; 查看服务器数据库
use 'name'; 使用当前数据库
select * from 'name'; 查找内容
exit; 退出

1.终端操作数据库
mysql -u root -p 登陆

查询数据库服务器中的数据库
show databases;

查询语句：
select * from 'name';
select * from 'name' where 'name'='内容';

如何退出数据库服务器
exit;

--如何在数据库服务器创建‘test’数据库
mysql> create database test;

--如何查看某个数据库的数据表？
mysql> show tables;

--如何创建一个'pet'数据库？
CREATE TABLE pet(
	name VARCHAR(20),
	owner VARCHAR(20),
	species VARCHAR(20),
	sex CHAR(1),
	birth DATE,
	death DATE
);

--查看创建好的数据表的结构(表格信息)
mysql> describe pet;

--如何向数据表中添加数据记录？
INSERT INTO pet
VALUES ('Puffball','Diane','hamster','f','1990-03-30',NULL);

--mysql常用数据类型
--MySQL支持多种类型，大致可以分为三类：
--数值
TINYINT	        1 字节	(-128，127)	(0，255)	小整数值
SMALLINT	    2 字节	(-32 768，32 767)	(0，65 535)	大整数值
MEDIUMINT	    3 字节	(-8 388 608，8 388 607)	(0，16 777 215)	大整数值
INT或INTEGER 	4 字节	(-2 147 483 648，2 147 483 647)	(0，4 294 967 295)	大整数值
BIGINT	        8 字节	(-9,223,372,036,854,775,808，9 223 372 036 854 775 807)	(0，18 446 744 073 709 551 615)	极大整数值
FLOAT	        4 字节	(-3.402 823 466 E+38，-1.175 494 351 E-38)，0，(1.175 494 351 E-38，3.402 823 466 351 E+38)	0，(1.175 494 351 E-38，3.402 823 466 E+38)	单精度 浮点数值
DOUBLE	        8 字节	(-1.797 693 134 862 315 7 E+308，-2.225 073 858 507 201 4 E-308)，0，(2.225 073 858 507 201 4 E-308，1.797 693 134 862 315 7 E+308)	0，(2.225 073 858 507 201 4 E-308，1.797 693 134 862 315 7 E+308)	双精度 浮点数值
DECIMAL	        对DECIMAL(M,D) ，如果M>D，为M+2否则为D+2	依赖于M和D的值	依赖于M和D的值	小数值

--日期/时间
DATE	    3	1000-01-01/9999-12-31	YYYY-MM-DD	日期值
TIME	    3	'-838:59:59'/'838:59:59'	HH:MM:SS	时间值或持续时间
YEAR	    1	1901/2155	YYYY	年份值
DATETIME	8	1000-01-01 00:00:00/9999-12-31 23:59:59	YYYY-MM-DD HH:MM:SS	混合日期和时间值
TIMESTAMP	4	1970-01-01 00:00:00/2038 结束时间是第 2147483647 秒，北京时间 2038-1-19 11:14:07，格林尼治时间 2038年1月19日 凌晨 03:14:07    YYYYMMDD HHMMSS	混合日期和时间值，时间戳

--字符串(字符)
CHAR	    0-255字节	定长字符串
VARCHAR	    0-65535 字节	变长字符串
TINYBLOB	0-255字节	不超过 255 个字符的二进制字符串
TINYTEXT	0-255字节	短文本字符串
BLOB	    0-65 535字节	二进制形式的长文本数据
TEXT	    0-65 535字节	长文本数据
MEDIUMBLOB	0-16 777 215字节	二进制形式的中等长度文本数据
MEDIUMTEXT	0-16 777 215字节	中等长度文本数据
LONGBLOB	0-4 294 967 295字节	二进制形式的极大文本数据
LONGTEXT	0-4 294 967 295字节	极大文本数据

--数据类型选择？
日期 选择按照格式
数值和字符看大小！
INT或INTEGER 	4 字节	(-2 147 483 648，2 147 483 647)	(0，4 294 967 295)	大整数值

DOUBLE	        8 字节	(-1.797 693 134 862 315 7 E+308，-2.225 073 858 507 201 4 E-308)，0，(2.225 073 858 507 201 4 E-308，1.797 693 134 862 315 7 E+308)	0，(2.225 073 858 507 201 4 E-308，1.797 693 134 862 315 7 E+308)	双精度 浮点数值

DATE	        3	1000-01-01/9999-12-31	YYYY-MM-DD	日期值

CHAR	        0-255字节	定长字符串

VARCHAR	        0-65535 字节	变长字符串

TEXT	    0-65 535字节	长文本数据

--如何删除数据表中的数据信息？
delete from pet where name='Fluffy';

--如何修改数据信息？
update pet set name='旺旺财' where owner='周星驰';

--总结：数据记录常用操作？
--增加
INSERT
--删除
delete
--修改
update
--查询
select